Repository: andrekirst/family
Catalog: src/api/Family.Api/Resources/Features/Families/FamilyValidationMessages.*.resx
Languages: de

# FamilyNameRequired
source: Family name is required.
de: Familienname ist erforderlich.

# FamilyNameMaxLength
source: Family name cannot exceed {0} characters.
de: Familienname darf maximal {0} Zeichen lang sein.

# FamilyNameMinLength
source: Family name must be at least {0} characters long.
de: Familienname muss mindestens {0} Zeichen lang sein.

# DescriptionMaxLength
source: Description cannot exceed {0} characters.
de: Beschreibung darf maximal {0} Zeichen lang sein.

# CreatedByRequired
source: Creator is required.
de: Ersteller ist erforderlich.

# CreatedByInvalid
source: Creator ID is invalid.
de: Ersteller-ID ist ungültig.

# MemberUserIdRequired
source: Family member user ID is required.
de: Benutzer-ID des Familienmitglieds ist erforderlich.

# MemberUserIdInvalid
source: Family member user ID is invalid.
de: Benutzer-ID des Familienmitglieds ist ungültig.

# MemberRoleRequired
source: Family member role is required.
de: Rolle des Familienmitglieds ist erforderlich.

# MemberRoleInvalid
source: Family member role is invalid. Allowed values: Admin, Member.
de: Rolle des Familienmitglieds ist ungültig. Erlaubt sind: Admin, Member.

# FamilyIdRequired
source: Family ID is required.
de: Familien-ID ist erforderlich.

# FamilyIdInvalid
source: Family ID is invalid.
de: Familien-ID ist ungültig.

source: Family not found.
de: Familie wurde nicht gefunden.

# FamilyNameAlreadyExists
source: A family with this name already exists.
de: Eine Familie mit diesem Namen existiert bereits.

# FamilyCreationFailed
source: Family could not be created.
de: Familie konnte nicht erstellt werden.

# FamilyUpdateFailed
source: Family could not be updated.
de: Familie konnte nicht aktualisiert werden.

# FamilyDeletionFailed
source: Family could not be deleted.
de: Familie konnte nicht gelöscht werden.

# MemberNotFound
source: Family member not found.
de: Familienmitglied wurde nicht gefunden.

# MemberAlreadyExists
source: User is already a member of this family.
de: Benutzer ist bereits Mitglied dieser Familie.

# MemberAdditionFailed
source: Family member could not be added.
de: Familienmitglied konnte nicht hinzugefügt werden.

# MemberRemovalFailed
source: Family member could not be removed.
de: Familienmitglied konnte nicht entfernt werden.

# CannotRemoveLastAdmin
source: Cannot remove the last administrator.
de: Der letzte Administrator kann nicht entfernt werden.

# InsufficientPermissions
source: Insufficient permissions for this action.
de: Unzureichende Berechtigung für diese Aktion.

# UserAlreadyHasFamily
source: User is already a member of a family.
de: Benutzer ist bereits Mitglied einer Familie.

# UserNotMemberOfFamily
source: User is not a member of this family.
de: Benutzer ist nicht Mitglied dieser Familie.

# RoleAssignmentSuccessful
source: Role assigned successfully.
de: Rolle wurde erfolgreich zugewiesen.

# RoleRevocationSuccessful
source: Role revoked successfully.
de: Rolle wurde erfolgreich entzogen.

source: Role assignment failed.
de: Rollenzuweisung fehlgeschlagen.

source: Role revocation failed.
de: Rollenentzug fehlgeschlagen.

# CannotRevokeOwnAdminRole
source: You cannot revoke your own administrator role.
de: Sie können Ihre eigene Administrator-Rolle nicht entziehen.

# FirstTimeUserDetected
source: New user detected. Family must be created.
de: Neuer Benutzer erkannt. Familie muss erstellt werden.

# WelcomeMessage
source: Welcome to Family! Please create your family first.
de: Willkommen bei Family! Erstellen Sie zunächst Ihre Familie.

source: User not authenticated.
de: Benutzer nicht authentifiziert.

source: Current user not found.
de: Aktueller Benutzer nicht gefunden.

source: Target user not found.
de: Zielbenutzer nicht gefunden.

# NotAuthorizedToAssignRoles
source: Not authorized to assign roles in this family.
de: Nicht berechtigt, Rollen in dieser Familie zuzuweisen.

# NotAuthorizedToRevokeRoles
source: Not authorized to revoke roles in this family.
de: Nicht berechtigt, Rollen in dieser Familie zu widerrufen.

# CannotRevokeFamilyOwnerRole
source: Cannot revoke the family owner's administrator role.
de: Die Administratorrolle des Familienbesitzers kann nicht widerrufen werden.

# CannotRevokeLastAdminRole
source: You cannot revoke your administrator role as you are the only administrator.
de: Sie können Ihre Administratorrolle nicht widerrufen, da Sie der einzige Administrator sind.

# AdminRoleAssignedSuccessfully
source: Administrator role successfully assigned to {0} {1}.
de: Administratorrolle erfolgreich an {0} {1} zugewiesen.

# AdminRoleRevokedSuccessfully
source: Administrator role successfully revoked from {0} {1}.
de: Administratorrolle von {0} {1} erfolgreich widerrufen.

# ErrorAssigningAdminRole
source: Error assigning administrator role.
de: Fehler beim Zuweisen der Administratorrolle.

# ErrorRevokingAdminRole
source: Error revoking administrator role.
de: Fehler beim Widerrufen der Administratorrolle.
